### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(file_to_load)

# Starter Notebook Information

![starter_2_purchase_data](Images/starter_purchase_data.jpg)

In [2]:
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

## Player Count

# Starter Notebook Information

![starter__player_count](Images/starter_player_count.jpg)

In [3]:
# Get the length of the series created by doing a value_count on pu
total_players = len(purchase_data_df["SN"].value_counts())

total_players

576

In [4]:
# Create a DataFrame of the result and update with total_players
total_player_count = pd.DataFrame({"Total Players":[total_players]})
total_player_count

   Total Players
0            576

## Purchasing Analysis (Total)

# Starter Notebook Information

![starter__purchasing_analysis_total](Images/starter_purchasing_analysis_total.jpg)

In [5]:
unique_items = len(purchase_data_df['Item ID'].value_counts())
unique_items

179

In [6]:
average_price = purchase_data_df['Price'].sum() / purchase_data_df['Purchase ID'].count()
average_price

3.0509871794871795

In [7]:
number_purchases = purchase_data_df['Purchase ID'].count()
number_purchases

780

In [8]:
total_revenue = purchase_data_df['Price'].sum()
total_revenue

2379.77

In [9]:
purchasing_totals_df = pd.DataFrame({"Number of Unique Items":[unique_items],
                                    "Average Price":[average_price],
                                    "Number of Purchases":[number_purchases],
                                    "Total Revenue":[total_revenue]  
                                    },)
purchasing_totals_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [10]:
#purchasing_totals_df.style.format({"Average Price": "${:20,.2f}"})
purchasing_totals_df["Average Price"] = purchasing_totals_df["Average Price"].map("${:,.2f}".format)
purchasing_totals_df["Total Revenue"] = purchasing_totals_df["Total Revenue"].map("${:,.2f}".format)
purchasing_totals_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

# Starter Notebook Information

![starter_gender_demographics](Images/starter_gender_demographics.jpg)

In [11]:
# Group purchase_data by Gender
grouped_gender_df = purchase_data_df.groupby("Gender")

In [12]:
# Count the total of screen names "SN" by gender
total_sn_by_gender = grouped_gender_df.nunique()["SN"]
total_sn_by_gender

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [13]:
# Total count by gender and divivde by total players 
percentage_of_players = total_sn_by_gender / total_players
percentage_of_players

Gender
Female                   0.140625
Male                     0.840278
Other / Non-Disclosed    0.019097
Name: SN, dtype: float64

In [14]:
# Add the data into the summary DataFram3e
gender_percent_summary_df = pd.DataFrame({"Total Count": total_sn_by_gender,"Percentage of Players": percentage_of_players})
gender_percent_summary_df

                       Total Count  Percentage of Players
Gender
Female                          81               0.140625
Male                           484               0.840278
Other / Non-Disclosed           11               0.019097

In [15]:
# Sort the data by Total Count
sorted_gender_percent_summary_df = gender_percent_summary_df.sort_values('Total Count',ascending=False)
sorted_gender_percent_summary_df

                       Total Count  Percentage of Players
Gender
Male                           484               0.840278
Female                          81               0.140625
Other / Non-Disclosed           11               0.019097

In [16]:
sorted_gender_percent_summary_df["Percentage of Players"] = sorted_gender_percent_summary_df["Percentage of Players"].map("{:.2%}".format)
sorted_gender_percent_summary_df.head()

                       Total Count Percentage of Players
Gender
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

## Purchasing Analysis (Gender)

# Starter Notebook Information

![starter_purchasing_analysis_gender](Images/starter_purchasing_analysis_gender.jpg)

In [17]:
gender_number_purchases = grouped_gender_df['Purchase ID'].count()
gender_number_purchases

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [18]:
gender_average_price = grouped_gender_df['Price'].sum() / grouped_gender_df['Purchase ID'].count()
gender_average_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
dtype: float64

In [19]:
gender_total_revenue = grouped_gender_df['Price'].sum()
gender_total_revenue

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [20]:
# Group purchase_data by Gender
grouped_sn_gender_df = purchase_data_df.groupby(["SN","Gender"])
grouped_sn_gender_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [21]:
total_purchase_gender_by_sn = grouped_sn_gender_df['Price'].sum()
total_purchase_gender_by_sn

SN             Gender
Adairialis76   Male      2.28
Adastirin33    Female    4.48
Aeda94         Male      4.91
Aela59         Male      4.32
Aelaria33      Male      1.79
                         ...
Yathecal82     Female    6.22
Yathedeu43     Male      6.02
Yoishirrala98  Female    4.58
Zhisrisu83     Male      7.89
Zontibe81      Male      8.03
Name: Price, Length: 576, dtype: float64

In [22]:
average_total_purchase_by_gender = total_purchase_gender_by_sn.groupby('Gender').mean()
average_total_purchase_by_gender

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
Name: Price, dtype: float64

In [23]:
# Add the data into the summary DataFram3e
purchasing_analysis_gender_df = pd.DataFrame({"Purchase Count": gender_number_purchases,
                                              "Average Purchase Price": gender_average_price,
                                              "Total Purchase Value": gender_total_revenue,
                                             "Average Total Purchase Per Person": average_total_purchase_by_gender
                                            })
purchasing_analysis_gender_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase Per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [24]:
purchasing_analysis_gender_df["Average Purchase Price"] = purchasing_analysis_gender_df["Average Purchase Price"].map("${:,.2f}".format)
purchasing_analysis_gender_df["Total Purchase Value"] = purchasing_analysis_gender_df["Total Purchase Value"].map("${:,.2f}".format)
purchasing_analysis_gender_df["Average Total Purchase Per Person"] = purchasing_analysis_gender_df["Average Total Purchase Per Person"].map("${:,.2f}".format)
purchasing_analysis_gender_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase Per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

# Starter notebook information

![starter_age_demographics](Images/starter_age_demographics.jpg)

In [25]:
# Create bins in which to place values based upon age
bins = [0, 9.9, 13.9, 18.9, 23.9, 28.9, 33.9, 38.9, 125]

# Create labels for these bins
group_labels = ["  <10", "10-14", "15-19", "20-24", "25-29", "30-34",
                "35_39", "  40+"]

In [26]:
# Slice the data and place it into bins
purchase_data_df['Age Ranges'] = pd.cut(purchase_data_df["Age"],bins,labels=group_labels,include_lowest=True)
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,25-29
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,25-29
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,25-29

In [27]:
grouped_age_ranges_df = purchase_data_df.groupby('Age Ranges')

In [28]:
# Count the total of screen names "SN" by age group
total_sn_by_age_ranges = grouped_age_ranges_df["SN"].nunique()
total_sn_by_age_ranges

Age Ranges
  <10     17
10-14     20
15-19     92
20-24    227
25-29    115
30-34     55
35_39     32
  40+     18
Name: SN, dtype: int64

In [29]:
# # Total count by gender and divivde by total players 
percentage_of_players_by_age_ranges = total_sn_by_age_ranges / total_players
percentage_of_players_by_age_ranges

Age Ranges
  <10    0.029514
10-14    0.034722
15-19    0.159722
20-24    0.394097
25-29    0.199653
30-34    0.095486
35_39    0.055556
  40+    0.031250
Name: SN, dtype: float64

In [30]:
# Add the data into the summary DataFram3e
age_range_percent_summary_df = pd.DataFrame({"Total Count": total_sn_by_age_ranges,"Percentage of Players": percentage_of_players_by_age_ranges})
age_range_percent_summary_df

            Total Count  Percentage of Players
Age Ranges
  <10                17               0.029514
10-14                20               0.034722
15-19                92               0.159722
20-24               227               0.394097
25-29               115               0.199653
30-34                55               0.095486
35_39                32               0.055556
  40+                18               0.031250

In [31]:
age_range_percent_summary_df["Percentage of Players"] = age_range_percent_summary_df["Percentage of Players"].map("{:.2%}".format)
age_range_percent_summary_df

            Total Count Percentage of Players
Age Ranges
  <10                17                 2.95%
10-14                20                 3.47%
15-19                92                15.97%
20-24               227                39.41%
25-29               115                19.97%
30-34                55                 9.55%
35_39                32                 5.56%
  40+                18                 3.12%

## Purchasing Analysis (Age)

# Starter notebook information

![starter_purchasing_analysis_age](Images/starter_purchasing_analysis_age.jpg)

In [32]:
age_ranges_number_purchases = grouped_age_ranges_df['Purchase ID'].count()
age_ranges_number_purchases

Age Ranges
  <10     23
10-14     26
15-19    115
20-24    321
25-29    155
30-34     77
35_39     44
  40+     19
Name: Purchase ID, dtype: int64

In [33]:
age_ranges_average_price = grouped_age_ranges_df['Price'].sum() / grouped_age_ranges_df['Purchase ID'].count()
age_ranges_average_price

Age Ranges
  <10    3.353478
10-14    2.918077
15-19    3.041913
20-24    3.033707
25-29    3.019290
30-34    2.949351
35_39    3.329091
  40+    3.240000
dtype: float64

In [34]:
age_ranges_total_revenue = grouped_age_ranges_df['Price'].sum()
age_ranges_total_revenue

Age Ranges
  <10     77.13
10-14     75.87
15-19    349.82
20-24    973.82
25-29    467.99
30-34    227.10
35_39    146.48
  40+     61.56
Name: Price, dtype: float64

In [35]:
# Group purchase_data by Gender
grouped_sn_age_ranges_df = purchase_data_df.groupby(["SN","Age Ranges"])
grouped_sn_age_ranges_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,25-29
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,25-29
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,25-29

In [36]:
total_purchase_age_ranges_by_sn = grouped_sn_age_ranges_df['Price'].sum()
total_purchase_age_ranges_by_sn

SN            Age Ranges
Adairialis76    <10          NaN
              10-14          NaN
              15-19         2.28
              20-24          NaN
              25-29          NaN
                            ...
Zontibe81     20-24         8.03
              25-29          NaN
              30-34          NaN
              35_39          NaN
                40+          NaN
Name: Price, Length: 4608, dtype: float64

In [37]:
average_total_purchase_by_age_ranges = total_purchase_age_ranges_by_sn.groupby('Age Ranges').mean()
average_total_purchase_by_age_ranges

Age Ranges
  <10    4.537059
10-14    3.793500
15-19    3.802391
20-24    4.289956
25-29    4.069478
30-34    4.129091
35_39    4.577500
  40+    3.420000
Name: Price, dtype: float64

In [38]:
# Add the data into the summary DataFram3e
purchasing_analysis_age_ranges_df = pd.DataFrame({"Purchase Count": age_ranges_number_purchases,
                                              "Average Purchase Price": age_ranges_average_price,
                                              "Total Purchase Value": age_ranges_total_revenue,
                                             "Average Total Purchase Per Person": average_total_purchase_by_age_ranges
                                            })
purchasing_analysis_age_ranges_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase Per Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,26,2.918077,75.87,3.793500
15-19,115,3.041913,349.82,3.802391
20-24,321,3.033707,973.82,4.289956
25-29,155,3.019290,467.99,4.069478
30-34,77,2.949351,227.10,4.129091
35_39,44,3.329091,146.48,4.577500
40+,19,3.240000,61.56,3.420000

In [39]:
purchasing_analysis_age_ranges_df["Average Purchase Price"] = purchasing_analysis_age_ranges_df["Average Purchase Price"].map("${:,.2f}".format)
purchasing_analysis_age_ranges_df["Total Purchase Value"] = purchasing_analysis_age_ranges_df["Total Purchase Value"].map("${:,.2f}".format)
purchasing_analysis_age_ranges_df["Average Total Purchase Per Person"] = purchasing_analysis_age_ranges_df["Average Total Purchase Per Person"].map("${:,.2f}".format)
purchasing_analysis_age_ranges_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase Per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,26,$2.92,$75.87,$3.79
15-19,115,$3.04,$349.82,$3.80
20-24,321,$3.03,$973.82,$4.29
25-29,155,$3.02,$467.99,$4.07
30-34,77,$2.95,$227.10,$4.13
35_39,44,$3.33,$146.48,$4.58
40+,19,$3.24,$61.56,$3.42

## Top Spenders

# Starter notebook information

![starter_top_spenders](Images/starter_top_spenders.jpg)

In [40]:
grouped_by_sn_df = purchase_data_df.groupby('SN')

In [41]:
sn_number_purchases = grouped_by_sn_df['Purchase ID'].count()
sn_number_purchases

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase ID, Length: 576, dtype: int64

In [42]:
sn_average_price = grouped_by_sn_df['Price'].sum() / grouped_by_sn_df['Purchase ID'].count()
sn_average_price

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Length: 576, dtype: float64

In [43]:
sn_total_revenue = grouped_by_sn_df['Price'].sum()
sn_total_revenue

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [44]:
# Add the data into the summary DataFram3e
top_spenders_df = pd.DataFrame({"Purchase Count": sn_number_purchases,
                                              "Average Purchase Price": sn_average_price,
                                              "Total Purchase Value": sn_total_revenue,
                                            })
top_spenders_df

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [45]:
# Sort the data by Total Count
sorted_top_speners_df = top_spenders_df.sort_values('Total Purchase Value',ascending=False)
sorted_top_speners_df.head(5)

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [46]:
sorted_top_speners_df["Average Purchase Price"] = sorted_top_speners_df["Average Purchase Price"].map("${:,.2f}".format)
sorted_top_speners_df["Total Purchase Value"] = sorted_top_speners_df["Total Purchase Value"].map("${:,.2f}".format)
sorted_top_speners_df

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10
...                     ...                    ...                  ...
Ililsasya43               1                  $1.02                $1.02
Irilis75                  1                  $1.02                $1.02
Aidai61                   1                  $1.01                $1.01
Chanirra79                1                  $1.01                $1.01
Alo38                     1                  $1.00                $1.00

[576 rows x 3 columns]

In [47]:
top_5_spenders_df = sorted_top_speners_df.head()
top_5_spenders_df

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

# Starter notebook information

![starter_most_popular_items](Images/starter_most_popular_items.jpg)

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

# Starter notebook information

![starter_most_profitable_items](Images/starter_most_profitable_items.jpg)